
'use client';

export type TeacherLesson = {
  subject: string;
  class: string;
};

export type TeacherAvailability = {
  teacherName: string;
  schedule: (TeacherLesson | null)[];
};

export type DailySchedule = {
  [day: string]: TeacherAvailability[];
};

const rawDataByDay: { [key: string]: any[] } = {
  "ראשון": [
    {
        "מערכת שעות שחף - יסודי זומר רמת גן": "מורה",
        "Column2": 1, "Column3": 2, "Column4": 3, "Column5": 4, "Column6": 5, "Column7": 6, "Column8": 7, "Column9": 8, "Column10": 9
    },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "לידני אביב" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "דמארי אדווה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "זהבי אהובה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "סקiרצ'רו אופיר", "Column2": "מתמטיקה, ח1תלתן", "Column4": "מתמטיקה, ח1תלתן", "Column5": "מתמטיקה, ח2נועם", "Column6": "מתמטיקה, ז1קמה", "Column7": "מתמטיקה, ח1תלתן", "Column8": "מתמטיקה, ח2נועם" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "בן יהודה קימל אורי" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ארבל אורנה", "Column5": "סיוע מלאכה, ה2שחף", "Column6": "מלאכה, ג2שיזף" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "חמדי אורנה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "חוסיין אחמד", "Column4": "חינוך גופני, ה1דרור", "Column6": "שעת משחק, ד2ערבינחל", "Column7": "חינוך גופני, ה2שחף" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "לוי אלרד איילת" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "כלים אישיים" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "אלון אליה", "Column5": "התבגרות, ז2יערה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "צוקר במבי", "Column2": "אנגלית, ח1תלתן", "Column3": "אנגלית, ה1דרור", "Column4": "אנגלית, ח1תלתן", "Column5": "אנגלית, ה1דרור", "Column6": "אנגלית, ח1תלתן", "Column7": "אנגלית, ו1חושן" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מויסה בר" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "אליהו גיא", "Column2": "ראשי, ז1קמה", "Column3": "ראשי, ז1קמה", "Column4": "התבגרות, ז1קמה", "Column5": "מחנך נוסף, ג2שיזף", "Column6": "מחנך נוסף, ה2שחף", "Column7": "ראשי, ז1קמה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "אברמוב דניאל", "Column2": "ראשי, ד2ערבינחל", "Column3": "ראשי, ד2ערבינחל", "Column4": "ראשי, ד2ערבינחל", "Column5": "תרגול שפה, ד2ערבינחל" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "זיו הדס", "Column5": "מתמטיקה, ו2מעיין", "Column6": "מתמטיקה, ו1חושן" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "תורן הילה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "בר מצליח הילית", "Column5": "תנועה, א2", "Column6": "תנועה, א1" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "צידון זוהר", "Column2": "עץ, ה2שחף", "Column3": "עץ, ה2שחף", "Column4": "עץ, ה2שחף", "Column5": "עץ, ה2שחף", "Column6": "עץ, ו2מעיין", "Column7": "עץ, ו2מעיין" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חליל" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "יפלח חן", "Column2": "ראשי, ג2שיזף", "Column3": "ראשי, ג2שיזף", "Column4": "שעת סיפור, ג1אלומה", "Column7": "תרגול שפה, ג2שיזף" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חצוצרה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה קונטרבאס" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ממן טל", "Column4": "אנגלית, ג2שיזף", "Column5": "אנגלית, ד1תלמא", "Column6": "אנגלית, א2", "Column7": "אנגלית, ג1אלומה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "רייף טלילה", "Column2": "ראשי, ד1תלמא", "Column3": "ראשי, ד1תלמא", "Column4": "מוסיקה, ד1תלמא", "Column6": "תרגול חשבון, ד1תלמא" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה טרומבון" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "סוסתיאל בן עמי יוני" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ביגלאייזן יעל", "Column2": "ראשי, ג1אלומה", "Column3": "ראשי, ג1אלומה", "Column5": "מוסיקה, ג1אלומה", "Column6": "תרגול חשבון, ג1אלומה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "זיסר קנה יעל", "Column2": "ראשי, ז2יערה", "Column3": "מוסיקה, ז2יערה", "Column5": "התבגרות, ז2יערה", "Column6": "שעת סיפור, ב2מפרש", "Column7": "ראשי, ז2יערה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "זהבי ירמי", "Column2": "מוסיקה, ו1חושן", "Column3": "ראשי, ו1חושן", "Column4": "תרגול שפה, ו1חושן", "Column5": "תרגול שפה, ו1חושן", "Column7": "התבגרות, ח2נועם" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה כלי הקשה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "שטיינברג עדן", "Column2": "תומכ.ת הוראה א', א1", "Column3": "תומכ.ת הוראה א', א1", "Column4": "תומכ.ת הוראה א', א1", "Column5": "תומכ.ת הוראה א', א1" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "אדלר ליאת" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "שלוגר - כהן ליבי" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מזה-קיבוביץ ליזט", "Column4": "התבגרות, ז1קמה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "לברטוב לימור" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "אלה לירז", "Column4": "אמנות, ו1חושן", "Column5": "אמנות, ו1חושן", "Column6": "מלאכה, ו2מעיין", "Column7": "מלאכה, ו2מעיין" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה לכלבנות", "Column2": "כלבנות", "Column3": "כלבנות", "Column4": "כלבנות", "Column5": "כלבנות" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "נבו מאורי", "Column4": "מוסיקה, ד1תלמא", "Column5": "מוסיקה, ג1אלומה", "Column6": "מוסיקה, ה1דרור", "Column7": "מוסיקה, ד2ערבינחל" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "קורנברג מאיה", "Column4": "ראשי, ח2נועם", "Column5": "סיוע, ב1אופק", "Column6": "ראשי, ח2נועם", "Column7": "התבגרות, ח2נועם" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חווה 1" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חווה 3" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה ימייה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "טרויינר מיה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "בקמן מיכאל" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "דרכר אורן מיכל", "Column2": "ראשי, א1", "Column3": "ראשי, א1", "Column4": "צבעי מים, א1", "Column5": "צבעי מים, א1", "Column6": "תנועה, א1", "Column7": "חינוך, א1" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "סימן טוב מיקי", "Column2": "חינוך גופני, ח2נועם", "Column3": "חינוך גופני, ח1תלתן", "Column4": "חינוך גופני, ו2מעיין", "Column5": "חינוך גופני, ז1קמה", "Column6": "חינוך גופני, ז2יערה", "Column8": "חינוך גופני, ו1חושן" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "וקסלר מרה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "פלאוט איתי" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ברוידא נועה", "Column2": "ראשי, ב2מפרש", "Column3": "ראשי, ב2מפרש", "Column4": "צבעי מים, ב2מפרש", "Column5": "צבעי מים, ב2מפרש", "Column7": "חינוך, ב2מפרש" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "בת שלמה ניצה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "אדר ניצן" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "עיד נסרין", "Column2": "ערבית, ה1דרור", "Column3": "ערבית, ח2נועם", "Column4": "ערבית, ז2יערה", "Column5": "ערבית, ח1תלתן" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה סקסופון" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ענבר עוז" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "פורטס עופרה", "Column2": "מוסיקה, ו1חושן", "Column3": "מוסיקה, ז2יערה", "Column5": "תנועה, א2", "Column6": "תנועה, א1" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "סולקין עינת", "Column2": "ראשי, ב1אופק", "Column3": "ראשי, ב1אופק", "Column4": "צבעי מים, ב1אופק", "Column5": "צבעי מים, ב1אופק", "Column6": "חינוך, ב1אופק", "Column7": "חינוך, ב1אופק" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ישראלי עלמה" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ביגלאייזן קורין" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "מורה קלרינט" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ינאי קרן", "Column2": "ראשי, א2", "Column3": "ראשי, א2", "Column4": "חינוך, א2", "Column5": "תנועה, א2", "Column7": "חינוך, א2" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "פאל אלגוסי רונית", "Column2": "מלאכה, ה2שחף", "Column3": "מלאכה, ה2שחף", "Column4": "מלאכה, ה2שחף", "Column5": "מלאכה, ה2שחף", "Column6": "סיוע מלאכה, ו2מעיין", "Column7": "סיוע מלאכה, ו2מעיין" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ארבל רות", "Column2": "ראשי, ו2מעיין", "Column3": "ראשי, ו2מעיין" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "ברמי רותי", "Column2": "סיוע מלאכה, ה2שחף", "Column3": "סיוע מלאכה, ה2שחף", "Column4": "סיוע מלאכה, ה2שחף", "Column6": "סיוע מלאכה, ג2שיזף" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "עבדו ריהאם" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "טלר רן", "Column2": "תומכ.ת הוראה א', א2", "Column3": "תומכ.ת הוראה א', א2", "Column4": "תומכ.ת הוראה א', א2", "Column6": "סיוע מלאכה, ג2שיזף", "Column7": "עמלנות, ה1דרור" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "דוד רעות" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "תבור תום" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "רובין תומר", "Column2": "חינוך גופני, ח2נועם", "Column3": "חינוך גופני, ח1תלתן", "Column4": "חינוך גופני, ו2מעיין", "Column5": "חינוך גופני, ז1קמה", "Column6": "חינוך גופני, ז2יערה", "Column7": "חינוך גופני, ד1תלמא", "Column8": "חינוך גופני, ו1חושן" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "טרודרט תמר" },
    { "מערכת שעות שחף - יסודי זומר רמת גן": "שמש זוהר", "Column2": "סיוע עץ, ה2שחף", "Column3": "סיוע עץ, ה2שחף", "Column4": "סיוע עץ, ה2שחף", "Column5": "סיוע עץ, ה2שחף" }
  ],
  "שני": [
    null,
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורים פנוים לתאריך 15.09.2025"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה",
     "Column2": 1,
     "Column3": 2,
     "Column4": 3,
     "Column5": 4,
     "Column6": 5,
     "Column7": 6,
     "Column8": 7,
     "Column9": 8,
     "Column10": 9
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "לידני אביב"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "דמארי אדווה",
     "Column4": "פגישת מחנכות נועם",
     "Column5": "אנגלית, ד2ערבינחל",
     "Column6": "דרמה - תקופת הצגה, ח2נועם"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "זהבי אהובה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "סקiרצ'רו אופיר",
     "Column4": "מתמטיקה, ח2נועם",
     "Column6": "מתמטיקה, ח1תלתן",
     "Column7": "מתמטיקה, ז2יערה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "בן יהודה קימל אורי"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ארבל אורנה",
     "Column4": "מלאכה, ג2שיזף",
     "Column5": "סיוע מלאכה, ב2מפרש"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "חמדי אורנה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "חוסיין אחמד",
     "Column4": "חינוך גופני, ד2ערבינחל",
     "Column5": "שעת משחק, ג2שיזף",
     "Column7": "חינוך גופני, ג1אלומה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "לוי אלרד איילת",
     "Column2": "ראשי, ח1תלתן",
     "Column3": "ראשי, ח1תלתן",
     "Column7": "מחנך נוסף, ב2מפרש",
     "Column8": "שפה, ח1תלתן"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "כלים אישיים"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "אלון אליה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "צוקר במבי",
     "Column2": "אנגלית, ו1חושן",
     "Column3": "אנגלית, ו1חושן",
     "Column4": "אנגלית, ה1דרור",
     "Column5": "אנגלית, ז1קמה",
     "Column6": "אנגלית, ו1חושן",
     "Column7": "אנגלית, ח1תלתן"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מויסה בר",
     "Column2": "סיוע מלאכה, ג1אלומה",
     "Column4": "מלאכה, ח1תלתן",
     "Column5": "מלאכה, ח1תלתן",
     "Column7": "מלאכה, ד2ערבינחל"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "אליהו גיא",
     "Column2": "ימייה, ז1קמה",
     "Column3": "ימייה, ז1קמה",
     "Column4": "ימייה, ז1קמה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "אברמוב דניאל",
     "Column2": "ראשי, ד2ערבינחל",
     "Column3": "ראשי, ד2ערבינחל",
     "Column4": "מחנך נוסף, א1",
     "Column6": "צבעי מים, ד2ערבינחל"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "זיו הדס",
     "Column3": "מנדט קולגיום",
     "Column4": "מתמטיקה, ו1חושן",
     "Column5": "מתמטיקה, ו1חושן"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "תורן הילה",
     "Column2": "ראשי, ה2שחף",
     "Column3": "ראשי, ה2שחף",
     "Column5": "תרגול שפה, ה2שחף",
     "Column6": "ראשי, ה2שחף",
     "Column7": "חונכות, ה2שחף"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "בר מצליח הילית"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "צידון זוהר",
     "Column4": "סיוע עץ, ז2יערה",
     "Column5": "סיוע עץ, ז2יערה",
     "Column6": "עץ, ז1קמה",
     "Column7": "עץ, ז1קמה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חליל"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "יפלח חן",
     "Column2": "ראשי, ג2שיזף",
     "Column3": "ראשי, ג2שיזף",
     "Column6": "תרגול שפה, ג2שיזף"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חצוצרה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה קונטרבאס"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ממן טל",
     "Column3": "מנדט קולגיום",
     "Column4": "אנגלית, ב2מפרש",
     "Column5": "מחנך נוסף, ג1אלומה",
     "Column6": "אנגלית, ד1תלמא",
     "Column7": "אנגלית, א1"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "רייף טלילה",
     "Column2": "ראשי, ד1תלמא",
     "Column3": "ראשי, ד1תלמא",
     "Column4": "תרגול שפה, ד1תלמא",
     "Column7": "חינוך, ד1תלמא"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה טרומבון"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "סוסתיאל בן עמי יוני",
     "Column2": "מוסיקה, ו2מעיין",
     "Column4": "מוסיקה, ב1אופק",
     "Column5": "מוסיקה, א1"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ביגלאייזן יעל"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "זיסר קנה יעל",
     "Column2": "ראשי, ז2יערה",
     "Column3": "ראשי, ז2יערה",
     "Column4": "תרגול שפה, ו1חושן",
     "Column5": "תרגול שפה, ו1חושן"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "זהבי ירמי"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה כלי הקשה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "שטיינברג עדן",
     "Column2": "תומכ.ת הוראה א', א1",
     "Column3": "תומכ.ת הוראה א', א1",
     "Column4": "תומכ.ת הוראה א', א1",
     "Column5": "תומכ.ת הוראה א', א1"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "אדלר ליאת",
     "Column2": "מלאכה, ג1אלומה",
     "Column3": "מנדט קולגיום",
     "Column4": "סיוע מלאכה, ח1תלתן",
     "Column5": "סיוע מלאכה, ח1תלתן",
     "Column6": "סיוע מלאכה, ב1אופק",
     "Column7": "מלאכה, ח2נועם",
     "Column8": "מלאכה, ח2נועם"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "שלוגר - כהן ליבי"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מזה-קיבוביץ ליזט"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "לברטוב לימור"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "אלה לירז",
     "Column2": "אמנות, ו1חושן",
     "Column3": "אמנות, ו1חושן",
     "Column5": "מלאכה, ב2מפרש",
     "Column6": "אמנות, ז1קמה",
     "Column7": "אמנות, ז1קמה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה לכלבנות"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "נבו מאורי"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "קורנברג מאיה",
     "Column2": "ראשי, ח2נועם",
     "Column3": "ראשי, ח2נועם",
     "Column4": "פגישת מחנכות נועם",
     "Column5": "דרמה - תקופת הצגה, ח2נועם",
     "Column6": "דרמה - תקופת הצגה, ח2נועם"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חווה 1"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חווה 3"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה ימייה",
     "Column2": "ימייה, ז1קמה",
     "Column3": "ימייה, ז1קמה",
     "Column4": "ימייה, ז1קמה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "טרויינר מיה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "בקמן מיכאל",
     "Column2": "ראשי, ה1דרור",
     "Column3": "ראשי, ה1דרור",
     "Column4": "עמלנות, ג1אלומה",
     "Column6": "צבעי מים, ה1דרור",
     "Column7": "תרגול חשבון, ה1דרור"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "דרכר אורן מיכל"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "סימן טוב מיקי"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "וקסלר מרה",
     "Column2": "סיוע מלאכה, ג1אלומה",
     "Column3": "מנדט קולגיום",
     "Column4": "אמנות, ח1תלתן",
     "Column5": "אמנות, ח1תלתן",
     "Column6": "אמנות, ו2מעיין",
     "Column7": "אמנות, ו2מעיין"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "פלאוט איתי"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ברוידא נועה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "בת שלמה ניצה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "אדר ניצן",
     "Column2": "מחנך מחליף, ב2מפרש",
     "Column3": "מחנך מחליף, ב2מפרש",
     "Column4": "אמנות, ז2יערה",
     "Column5": "אמנות, ז2יערה",
     "Column6": "עמלנות, ב2מפרש",
     "Column7": "אמנות, ח2נועם",
     "Column8": "אמנות, ח2נועם"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "עיד נסרין",
     "Column4": "ערבית, ה2שחף",
     "Column5": "ערבית, ה1דרור",
     "Column6": "ערבית, ז2יערה",
     "Column7": "ערבית, ו1חושן"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה סקסופון"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ענבר עוז"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "פורטס עופרה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "סולקין עינת",
     "Column2": "ראשי, ב1אופק",
     "Column3": "ראשי, ב1אופק",
     "Column7": "חינוך, ב1אופק"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ישראלי עלמה"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ביגלאייזן קורין"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "מורה קלרינט"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ינאי קרן",
     "Column2": "ראשי, א2",
     "Column3": "ראשי, א2",
     "Column5": "צבעי מים, א2",
     "Column6": "צבעי מים, א2",
     "Column7": "חונכות, א2"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "פאל אלגוסי רונית",
     "Column4": "סיוע מלאכה, ג2שיזף",
     "Column5": "שעת סיפור, ד1תלמא",
     "Column6": "מלאכה, ב1אופק",
     "Column7": "סיוע מלאכה, ח2נועם",
     "Column8": "סיוע מלאכה, ח2נועם"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ארבל רות",
     "Column2": "מוסיקה, ו2מעיין",
     "Column3": "ראשי, ו2מעיין",
     "Column4": "דרמה - תקופת הצגה, ו2מעיין",
     "Column5": "דרמה - תקופת הצגה, ו2מעיין",
     "Column6": "תרגול שפה, ו2מעיין",
     "Column7": "תרגול שפה, ו2מעיין"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "ברמי רותי"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "עבדו ריהאם",
     "Column3": "מחנך מחליף, ג1אלומה",
     "Column4": "ערבית, א2",
     "Column5": "ערבית, ב1אופק",
     "Column6": "ערבית, ג1אלומה",
     "Column7": "ערבית, ג2שיזף"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "טלר רן",
     "Column2": "תומכ.ת הוראה א', א2",
     "Column3": "תומכ.ת הוראה א', א2",
     "Column4": "סיוע מלאכה, ג2שיזף",
     "Column5": "תומכ.ת הוראה א', א2",
     "Column6": "תומכ.ת הוראה א', א2",
     "Column7": "סיוע מלאכה, ד2ערבינחל"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "דוד רעות"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "תבור תום",
     "Column2": "מחנך מחליף, א1",
     "Column3": "מחנך מחליף, א1",
     "Column4": "עץ, ז2יערה",
     "Column5": "עץ, ז2יערה",
     "Column6": "מחנך מחליף, א1"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "רובין תומר"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "טרודרט תמר",
     "Column4": "דרמה - תקופת הצגה, ו2מעיין",
     "Column5": "דרמה - תקופת הצגה, ח2נועם",
     "Column6": "דרמה - תקופת הצגה, ח2נועם"
    },
    {
     "מערכת שעות שחף - יסודי זומר רמת גן": "שמש זוהר",
     "Column6": "סיוע עץ, ז1קמה",
     "Column7": "סיוע עץ, ז1קמה"
    }
   ],
  "שלישי": 
  [
 null,
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורים פנוים לתאריך 16.09.2025"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה",
  "Column2": 1,
  "Column3": 2,
  "Column4": 3,
  "Column5": 4,
  "Column6": 5,
  "Column7": 6,
  "Column8": 7,
  "Column9": 8,
  "Column10": 9
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "לידני אביב",
  "Column4": "מוסיקה, ז1קמה",
  "Column5": "מוסיקה, ח2נועם",
  "Column6": "מוסיקה, ז1קמה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "דמארי אדווה",
  "Column2": "אנגלית, ח2נועם",
  "Column4": "אנגלית, ה2שחף",
  "Column5": "מוסיקה, ח2נועם",
  "Column6": "אנגלית, ח2נועם",
  "Column7": "אנגלית, ח2נועם"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "זהבי אהובה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "סקiרצ'רו אופיר",
  "Column3": "מתמטיקה, ח2נועם",
  "Column4": "מתמטיקה, ז2יערה",
  "Column5": "מתמטיקה, ז2יערה",
  "Column6": "מתמטיקה, ח1תלתן",
  "Column7": "מתמטיקה, ז1קמה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "בן יהודה קימל אורי"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ארבל אורנה",
  "Column4": "סיוע מלאכה, ו1חושן",
  "Column5": "סיוע מלאכה, ו1חושן"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "חמדי אורנה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "חוסיין אחמד",
  "Column4": "שעת משחק, ב2מפרש",
  "Column5": "חינוך גופני, ה2שחף",
  "Column6": "חינוך גופני, ה1דרור",
  "Column7": "חינוך גופני, ג1אלומה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "לוי אלרד איילת",
  "Column2": "ראשי, ח1תלתן",
  "Column3": "דרמה - תקופת הצגה, ח1תלתן",
  "Column4": "דרמה - תקופת הצגה, ח1תלתן",
  "Column5": "התבגרות, ח1תלתן",
  "Column7": "ראשי, ח1תלתן",
  "Column8": "שפה, ח1תלתן"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "כלים אישיים"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "אלון אליה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "צוקר במבי"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מויסה בר",
  "Column2": "סיוע מלאכה, ח2נועם",
  "Column3": "סיוע מלאכה, ח2נועם",
  "Column4": "מלאכה, ו1חושן",
  "Column5": "מלאכה, ו1חושן",
  "Column6": "מלאכה, ו1חושן",
  "Column7": "מלאכה, ו1חושן"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "אליהו גיא",
  "Column2": "ראשי, ז1קמה",
  "Column3": "ראשי, ז1קמה",
  "Column4": "מוסיקה, ז1קמה",
  "Column5": "התבגרות, ח1תלתן",
  "Column8": "שפה, ז1קמה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "אברמוב דניאל",
  "Column2": "ראשי, ד2ערבינחל",
  "Column3": "ראשי, ד2ערבינחל",
  "Column4": "מוסיקה, ד2ערבינחל"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "זיו הדס",
  "Column2": "מחנך מחליף, ב1אופק",
  "Column3": "מחנך מחליף, ב1אופק",
  "Column4": "מתמטיקה, ו2מעיין",
  "Column5": "מתמטיקה, ו2מעיין"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "תורן הילה",
  "Column2": "ראשי, ה2שחף",
  "Column3": "מוסיקה, ה2שחף",
  "Column5": "עמלנות, ב1אופק",
  "Column6": "צבעי מים, ה2שחף",
  "Column7": "צבעי מים, ה2שחף"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "בר מצליח הילית"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "צידון זוהר",
  "Column4": "עץ, ו1חושן",
  "Column5": "עץ, ו1חושן",
  "Column6": "עץ, ו1חושן",
  "Column7": "עץ, ו1חושן"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חליל"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "יפלח חן",
  "Column2": "ראשי, ג2שיזף",
  "Column3": "ראשי, ג2שיזף",
  "Column4": "חווה חקלאית, ג1אלומה, ג2שיזף",
  "Column5": "חווה חקלאית, ג1אלומה, ג2שיזף",
  "Column7": "תרגול חשבון, ג2שיזף"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חצוצרה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה קונטרבאס"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ממן טל",
  "Column5": "אנגלית, א1",
  "Column6": "אנגלית, ב2מפרש",
  "Column7": "אנגלית, ב1אופק"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "רייף טלילה",
  "Column2": "ראשי, ד1תלמא",
  "Column3": "ראשי, ד1תלמא",
  "Column4": "תרגול שפה, ד1תלמא",
  "Column5": "חווה חקלאית, ד1תלמא, ד2ערבינחל",
  "Column6": "חווה חקלאית, ד1תלמא, ד2ערבינחל"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה טרומבון"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "סוסתיאל בן עמי יוני",
  "Column3": "מוסיקה, ה2שחף",
  "Column6": "מוסיקה, א2",
  "Column7": "מוסיקה, ו2מעיין"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ביגלאייזן יעל",
  "Column2": "ראשי, ג1אלומה",
  "Column3": "ראשי, ג1אלומה",
  "Column4": "חווה חקלאית, ג1אלומה, ג2שיזף",
  "Column5": "חווה חקלאית, ג1אלומה, ג2שיזף"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "זיסר קנה יעל",
  "Column2": "ראשי, ז2יערה",
  "Column3": "ראשי, ז2יערה",
  "Column6": "ימייה, ז2יערה",
  "Column7": "ימייה, ז2יערה",
  "Column8": "ימייה, ז2יערה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "זהבי ירמי",
  "Column2": "ראשי, ו1חושן",
  "Column3": "ראשי, ו1חושן",
  "Column8": "התבגרות, ו2מעיין"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה כלי הקשה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "שטיינברג עדן",
  "Column2": "תומכ.ת הוראה א', א1",
  "Column3": "תומכ.ת הוראה א', א1",
  "Column4": "תומכ.ת הוראה א', א1"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "אדלר ליאת",
  "Column2": "מלאכה, ח2נועם",
  "Column3": "מלאכה, ח2נועם",
  "Column6": "סיוע מלאכה, ו1חושן",
  "Column7": "סיוע מלאכה, ו1חושן"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "שלוגר - כהן ליבי"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מזה-קיבוביץ ליזט"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "לברטוב לימור"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "אלה לירז"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה לכלבנות"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "נבו מאורי",
  "Column4": "מוסיקה, ד2ערבינחל",
  "Column5": "מוסיקה, ה1דרור"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "קורנברג מאיה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חווה 1",
  "Column4": "חווה חקלאית, ג1אלומה, ג2שיזף",
  "Column5": "חווה חקלאית, ג1אלומה, ג2שיזף",
  "Column6": "חווה חקלאית, ג1אלומה, ג2שיזף"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה חווה 3",
  "Column5": "חווה חקלאית, ד1תלמא, ד2ערבינחל",
  "Column6": "חווה חקלאית, ד1תלמא, ד2ערבינחל",
  "Column7": "חווה חקלאית, ד1תלמא, ד2ערבינחל"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה ימייה",
  "Column6": "ימייה, ז2יערה",
  "Column7": "ימייה, ז2יערה",
  "Column8": "ימייה, ז2יערה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "טרויינר מיה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "בקמן מיכאל",
  "Column2": "ראשי, ה1דרור",
  "Column3": "ראשי, ה1דרור",
  "Column4": "חונכות, ה1דרור",
  "Column5": "מוסיקה, ה1דרור",
  "Column7": "ראשי, ה1דרור"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "דרכר אורן מיכל",
  "Column2": "ראשי, א1",
  "Column3": "ראשי, א1",
  "Column4": "חונכות, א1",
  "Column6": "חינוך, א1"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "סימן טוב מיקי"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "וקסלר מרה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "פלאוט איתי",
  "Column3": "דרמה - תקופת הצגה, ח1תלתן",
  "Column4": "דרמה - תקופת הצגה, ח1תלתן"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ברוידא נועה",
  "Column2": "ראשי, ב2מפרש",
  "Column3": "ראשי, ב2מפרש",
  "Column7": "חינוך, ב2מפרש"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "בת שלמה ניצה",
  "Column4": "אנגלית, ז2יערה",
  "Column5": "אנגלית, ז2יערה",
  "Column6": "אנגלית, ו2מעיין"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "אדר ניצן"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "עיד נסרין",
  "Column4": "ערבית, ח2נועם",
  "Column5": "ערבית, ז1קמה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה סקסופון"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ענבר עוז"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "פורטס עופרה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "סולקין עינת"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ישראלי עלמה"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ביגלאייזן קורין"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "מורה קלרינט"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ינאי קרן",
  "Column2": "ראשי, א2",
  "Column3": "ראשי, א2",
  "Column5": "חינוך, א2",
  "Column6": "מוסיקה, א2",
  "Column7": "חינוך, א2"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "פאל אלגוסי רונית"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ארבל רות",
  "Column2": "ראשי, ו2מעיין",
  "Column3": "ראשי, ו2מעיין",
  "Column4": "תרגול שפה, ו2מעיין",
  "Column5": "תרגול שפה, ו2מעיין",
  "Column7": "מוסיקה, ו2מעיין",
  "Column8": "התבגרות, ו2מעיין"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "ברמי רותי"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "עבדו ריהאם",
  "Column4": "ערבית, א2",
  "Column5": "ערבית, ב2מפרש",
  "Column6": "ערבית, ב1אופק",
  "Column7": "ערבית, א1"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "טלר רן",
  "Column2": "תומכ.ת הוראה א', א2",
  "Column3": "תומכ.ת הוראה א', א2",
  "Column4": "תומכ.ת הוראה א', א2"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "דוד רעות"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "תבור תום",
  "Column4": "מחנך נוסף, ב1אופק",
  "Column5": "חווה חקלאית, ד1תלמא, ד2ערבינחל",
  "Column6": "חווה חקלאית, ד1תלמא, ד2ערבינחל"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "רובין תומר"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "טרודרט תמר"
 },
 {
  "מערכת שעות שחף - יסודי זומר רמת גן": "שמש זוהר",
  "Column4": "סיוע עץ, ו1חושן",
  "Column5": "סיוע עץ, ו1חושן",
  "Column6": "סיוע עץ, ו1חושן",
  "Column7": "סיוע עץ, ו1חושן"
 }
]
}

const mainKey = "מערכת שעות שחף - יסודי זומר רמת גן";

export const days = ['ראשון', 'שני', 'שלישי', 'רביעי', 'חמישי', 'שישי'];

export const timeSlots = [
  { start: '08:00', end: '08:55' },
  { start: '08:55', end: '09:45' },
  { start: '10:15', end: '11:00' },
  { start: '11:05', end: '11:50' },
  { start: '12:05', end: '12:50' },
  { start: '13:15', end: '14:00' },
  { start: '14:00', end: '14:45' },
  { start: '14:45', end: '15:30' },
  { start: '15:30', end: '16:15' },
];

const parseSchedule = (data: any[]): TeacherAvailability[] => {
  if (!data) return [];
  const teachers: { [key: string]: TeacherAvailability } = {};
  
  data.forEach(row => {
    if (!row || typeof row !== 'object' || !row[mainKey]) return;

    const teacherName = row[mainKey].trim();
    if (teacherName === 'מורה' || teacherName.includes('מורים פנוים לתאריך')) return;
    
    if (!teachers[teacherName]) {
      teachers[teacherName] = {
        teacherName,
        schedule: Array(9).fill(null),
      };
    }

    for (let i = 2; i <= 10; i++) {
      const lessonKey = `Column${i}`;
      if (row[lessonKey]) {
        const value = row[lessonKey];
        if (typeof value === 'string') {
          const parts = value.split(',').map((s: string) => s.trim());
          const subject = parts[0] || '';
          const className = parts.slice(1).join(', ').trim();
          teachers[teacherName].schedule[i - 2] = { subject, class: className };
        } else {
          // Handle cases where the value is not a string (like numbers for time slots)
           teachers[teacherName].schedule[i - 2] = { subject: String(value), class: ''};
        }
      }
    }
  });

  const sortedTeachers = Object.values(teachers).sort((a, b) => {
    const lastNameA = a.teacherName.split(' ')[0];
    const lastNameB = b.teacherName.split(' ')[0];
    return lastNameA.localeCompare(lastNameB, 'he');
  });

  return sortedTeachers;
};

export const availableTeachersData: DailySchedule = Object.keys(rawDataByDay).reduce((acc: DailySchedule, day: string) => {
  acc[day] = parseSchedule(rawDataByDay[day]);
  return acc;
}, {});
